test/contracts/unbound-loop-4.cfg.dot
digraph "unbound-loop-4" {
    node [shape=box];
    subgraph "cluster_fn" {
        label="fn";
    }
    subgraph "cluster_test" {
        label="test";
        "test_142" [label="let a: Int = 20"];
        "test_143" [label="while (a > 10)"];
        "test_145" [label="fn(a)"];
        "test_148" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test_142" -> "test_143";
        "test_143" -> "test_145";
        "test_145" -> "test_143";
        "test_143" -> "test_148";
    }
}
