test/good/unbound-loop-4.cfg.mmd
graph TD
subgraph fn
end
subgraph test
    test_142["let a: Int = 20"]
    test_143["while (a &gt; 10)"]
    test_145["fn(a)"]
    test_148["return a"]:::exitNode
    test_142 --> test_143
    test_143 --> test_145
    test_145 --> test_143
    test_143 --> test_148
end
